[Killed] BlockStatement
calculaTaxaDesconto.js:1:72
-function calculaTaxaDesconto(primeiraCompra, tipoCliente, valorCompra) {
-    taxa = 0
-    if ((valorCompra >= 500) || (tipoCliente == "ouro")) {
-        return 15;
-    } else {
-        if ((tipoCliente == "prata") || (primeiraCompra === true) || (valorCompra >= 400)) {
-            taxa = 10;
-        } else {
-            if ((valorCompra >= 200) || (tipoCliente == "bronze")) {
-                taxa = 5
-            }
-        }
-    }
-    return taxa
-}
+function calculaTaxaDesconto(primeiraCompra, tipoCliente, valorCompra) {}
 
 module.exports = { calculaTaxaDesconto };
killedBy: valorCompra >= 500 - Todos os Caminhos Básicos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: undefined

[Killed] ConditionalExpression
calculaTaxaDesconto.js:3:9
 function calculaTaxaDesconto(primeiraCompra, tipoCliente, valorCompra) {
     taxa = 0
-    if ((valorCompra >= 500) || (tipoCliente == "ouro")) {
+    if (false) {
         return 15;
     } else {
killedBy: valorCompra >= 500 - Todos os Caminhos Básicos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: 10

[Killed] EqualityOperator
calculaTaxaDesconto.js:3:34
 function calculaTaxaDesconto(primeiraCompra, tipoCliente, valorCompra) {
     taxa = 0
-    if ((valorCompra >= 500) || (tipoCliente == "ouro")) {
+    if ((valorCompra >= 500) || (tipoCliente != "ouro")) {
         return 15;
     } else {
killedBy: tipoCliente == "prata" - Todos os Caminhos Básicos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 15

[Killed] BlockStatement
calculaTaxaDesconto.js:5:12
     taxa = 0
     if ((valorCompra >= 500) || (tipoCliente == "ouro")) {
         return 15;
-    } else {
-        if ((tipoCliente == "prata") || (primeiraCompra === true) || (valorCompra >= 400)) {
-            taxa = 10;
-        } else {
-            if ((valorCompra >= 200) || (tipoCliente == "bronze")) {
-                taxa = 5
-            }
-        }
-    }
+    } else {}
     return taxa
 }
killedBy: tipoCliente == "prata" - Todos os Caminhos Básicos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 0

[Killed] ConditionalExpression
calculaTaxaDesconto.js:6:42
     if ((valorCompra >= 500) || (tipoCliente == "ouro")) {
         return 15;
     } else {
-        if ((tipoCliente == "prata") || (primeiraCompra === true) || (valorCompra >= 400)) {
+        if ((tipoCliente == "prata") || (false) || (valorCompra >= 400)) {
             taxa = 10;
         } else {
killedBy: primeiraCompra === true
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 0

[Killed] ConditionalExpression
calculaTaxaDesconto.js:6:14
     if ((valorCompra >= 500) || (tipoCliente == "ouro")) {
         return 15;
     } else {
-        if ((tipoCliente == "prata") || (primeiraCompra === true) || (valorCompra >= 400)) {
+        if ((false) || (primeiraCompra === true) || (valorCompra >= 400)) {
             taxa = 10;
         } else {
killedBy: tipoCliente == "prata" - Todos os Caminhos Básicos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 10
Received: 5

[Killed] BlockStatement
calculaTaxaDesconto.js:8:16
     } else {
         if ((tipoCliente == "prata") || (primeiraCompra === true) || (valorCompra >= 400)) {
             taxa = 10;
-        } else {
-            if ((valorCompra >= 200) || (tipoCliente == "bronze")) {
-                taxa = 5
-            }
-        }
+        } else {}
     }
     return taxa
killedBy: valorCompra >= 200 - Todos os Caminhos Básicos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] ConditionalExpression
calculaTaxaDesconto.js:9:17
         if ((tipoCliente == "prata") || (primeiraCompra === true) || (valorCompra >= 400)) {
             taxa = 10;
         } else {
-            if ((valorCompra >= 200) || (tipoCliente == "bronze")) {
+            if (true) {
                 taxa = 5
             }
killedBy: Nenhuma condição atendida - retorna 0
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 5

[Killed] LogicalOperator
calculaTaxaDesconto.js:9:17
         if ((tipoCliente == "prata") || (primeiraCompra === true) || (valorCompra >= 400)) {
             taxa = 10;
         } else {
-            if ((valorCompra >= 200) || (tipoCliente == "bronze")) {
+            if (valorCompra >= 200 && tipoCliente == "bronze") {
                 taxa = 5
             }
killedBy: valorCompra >= 200 || tipoCliente == "bronze" - Todos os Caminhos Básicos
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0
